from calendar import THURSDAY, WEDNESDAY


class Days:
    MONDEY_ONE_WEEK = '''
9:55-11:30 Управление потоками в транспортых системах 
пр.,  доц. Пильгун Т.В., а 608  к.8
11:40-13:15 Управление потоками в транспортых системах лк.,  доц. Пильгун Т.В., а 2П к.8'''

    TUESDAY_ONE_WEEK = '''
вторник:
9 55 11 30 Управление цепями поставок лк.,  доц. Лапковская П.И., а 316 к.8
11 40 13 15 Ценообразование (тарифообразование) на автомобильном транспорте, лк.,  
доц., Тозик А.А., а. 316 к.8
13 55 15 30 Менеджмент пз., ст. пр., Скоркин Д.А., а 303  к.8
15 40 17 15 Профессиональный английский язык ст.пр. Левитская М.С., а 410 к.18
'''

    WEDNESDAY_ONE_WEEK ="""
8 00 9 35 басик)
9 55 11 30 Управление цепями поставок пз.,
  ассист. Бегун А.В., а 321 к.8
11 40 13 15 Управление потоками в транспортых системах лк.,  доц. Пильгун Т.В., а 606 к.8
"""

    WEDNESDAY_TWO_WEEK = """
8 00 9 35 басик)
9 55 11 30 Управление цепями поставок пз.,
  ассист. Бегун А.В., а 321 к.8
11 40 13 15 Консультация по курсовому проектированию Управление потоками в транспортых системах,  доц. Пильгун Т.В., а 606 к.8
"""


    THURSDAY_ONE_WEEK="""
9 55 11 30 Менеджмент лк., доц., Мойсак О.И., а 316 к.8
11 40 13 15 Бухгалтерский учет и аудит пз.,
доц., Мойсак О.И., а 608 к.8
13 55 15 30 Профессиональный английский язык ст.пр. Левитская М.С., а 503  к.18
15 40 17 15 Бухгалтерский учет и аудит лаб., 1/2 гр., доц., Мойсак О.И., а 321  к.8"""



    THURSDAY_TWO_WEEK = """
9 55 11 30 Менеджмент лк., доц., Мойсак О.И., а 316 к.8
11 40 13 15 Бухгалтерский учет и аудит пз.,
доц., Мойсак О.И., а 608 к.8
13 55 15 30 Профессиональный английский язык ст.пр. Левитская М.С., а 503  к.18
"""

    FRIDAY_ONE_WEEK = """
11 40 13 15 Бухгалтерский учет и аудит лк., доц., Мойсак О.И., а 606 к.8
13 55 15 30 Правовое регулирование перевозок грузов пз.,
  доц. Дятлов О.М., а 1108 к.8
15 40 17 15 Ценообразование (тарифообразование) на автомобильном транспорте, пз.,  ассист. Бегун А.В., а 321 к.8
"""
    
    FRIDAY_TWO_WEEK = """
9 55 11 30 Правовое регулирование перевозок грузов лк.,  доц. Дятлов О.М., а 801 к.8
11 40 13 15 Бухгалтерский учет и аудит лк., доц., Мойсак О.И., а 316 к.8
13 55 15 30 Правовое регулирование перевозок грузов пз.,
  доц. Дятлов О.М., а 1108 к.8
15 40 17 15 Кураторский час,  ст.пр., Копко Ю.А. а 321 к.8

"""
    

    SATURDAY_ONE_WEEK='''СЕГОДНЯ НЕТ ПАР!!! БУХАТЬ!!!'''

    SATURDAY_TWO_WEEK = """
9 55 11 30 Ценообразование (тарифообразование) на автомобильном транспорте, пз.,  ассист. Бегун А.В., а 608 к.8
11 40 13 15 Правовое регулирование перевозок грузов лк.,  доц. Дятлов О.М., а 307 к.8
"""
